const params = new URLSearchParams(window.location.search);

const homeTeam = params.get("home");
const awayTeam = params.get("away");

document.getElementById("matchTitle").innerHTML =
`${homeTeam} × ${awayTeam}`;

const matchAnalysis = {

"كندا|البوسنة والهرسك":`
📊 تحليل المباراة

🇨🇦 كندا

🌍 الترتيب العالمي: 30

📈 آخر 5 نتائج (الأقدم ← الأحدث):

✅ فوز 1-0 على غواتيمالا
🤝 تعادل 2-2 مع آيسلندا
🤝 تعادل 0-0 مع تونس
✅ فوز 2-0 على أوزبكستان
🤝 تعادل 1-1 مع إيرلندا

🚑 أبرز الغيابات:
لا توجد غيابات مؤثرة مؤكدة حالياً.

━━━━━━━━━━━━━━

🇧🇦 البوسنة والهرسك

🌍 الترتيب العالمي: 65

📈 آخر 5 نتائج (الأقدم ← الأحدث):

✅ فوز على ويلز (بركلات الترجيح)
✅ فوز على إيطاليا (بركلات الترجيح)
🤝 تعادل 0-0 مع مقدونيا الشمالية
🤝 تعادل 1-1 مع بنما
🤝 تعادل 1-1 مع النمسا

🚑 أبرز الغيابات:
لا توجد غيابات مؤثرة مؤكدة حالياً.

━━━━━━━━━━━━━━

📊 نسب التوقع:

🇨🇦 فوز كندا: 45%

🤝 التعادل: 31%

🇧🇦 فوز البوسنة والهرسك: 24%

🎯 النتيجة المتوقعة:

كندا 1-0 البوسنة والهرسك

📝 التحليل:

كندا تدخل المباراة بسلسلة نتائج مستقرة دون خسارة في آخر خمس مباريات، كما أنها أظهرت صلابة دفاعية واضحة. البوسنة بدورها قدمت تصفيات قوية وأقصت منتخبات كبيرة مثل إيطاليا وويلز، لكنها عانت هجومياً في المباريات الودية الأخيرة. أفضلية كندا تأتي من الاستقرار والانسجام، بينما تبقى البوسنة منافساً قادراً على خلق المفاجأة.

`,

"الولايات المتحدة|باراغواي":`
🌍 الترتيب العالمي: 17

📈 آخر 5 نتائج (الأقدم ← الأحدث):

✅ فوز 5-1 على الأوروغواي
❌ خسارة 2-5 أمام بلجيكا
❌ خسارة 0-2 أمام البرتغال
✅ فوز 3-2 على السنغال
❌ خسارة 1-2 أمام ألمانيا

🚑 أبرز الغيابات:
لا توجد غيابات مؤثرة مؤكدة حالياً.

━━━━━━━━━━━━━━

🇵🇾 باراغواي

🌍 الترتيب العالمي: 41

📈 آخر 5 نتائج (الأقدم ← الأحدث):

❌ خسارة 1-2 أمام الولايات المتحدة
✅ فوز 2-1 على المكسيك
✅ فوز 1-0 على اليونان
❌ خسارة 1-2 أمام المغرب
✅ فوز 4-0 على نيكاراغوا

🚑 أبرز الغيابات:
لا توجد غيابات مؤثرة مؤكدة حالياً.

━━━━━━━━━━━━━━

📊 نسب التوقع:

🇺🇸 فوز الولايات المتحدة: 52%

🤝 التعادل: 26%

🇵🇾 فوز باراغواي: 22%

🎯 النتيجة المتوقعة:

الولايات المتحدة 2-1 باراغواي

📝 التحليل:

رغم أن الولايات المتحدة خسرت ثلاثاً من آخر خمس مباريات، إلا أن تلك الخسائر جاءت أمام منتخبات قوية جداً مثل ألمانيا والبرتغال وبلجيكا. في المقابل، حققت باراغواي نتائج جيدة لكنها لم تواجه نفس مستوى المنافسة بشكل مستمر. عامل الأرض والجمهور إضافة إلى الجودة الفردية الأعلى يمنحان أفضلية للولايات المتحدة، لكن باراغواي تبقى قادرة على تهديد أي منتخب في الهجمات المرتدة
` 
};

const matchKey = `${homeTeam}|${awayTeam}`;

const analysis =
matchAnalysis[matchKey] ||
`
لا يوجد تحليل لهذه المباراة حالياً.

سيتم إضافة التحليل قبل موعد المباراة.
`;

document.getElementById("matchInfoContent").innerHTML = `
<div style="
    text-align:right;
    line-height:2;
    font-size:18px;
    white-space:pre-line;
    background:#ffffff;
    padding:20px;
    border-radius:15px;
">
${analysis}
</div>
`;