const params = new URLSearchParams(window.location.search);

const homeTeam = params.get("home");
const awayTeam = params.get("away");

document.getElementById("matchTitle").innerHTML =
`${homeTeam} × ${awayTeam}`;

const matchAnalysis = {

"المكسيك|جنوب افريقيا":`
📊 تحليل المباراة

🇲🇽 المكسيك

🌍 الترتيب العالمي: 15

📈 آخر 5 نتائج (الأقدم ← الأحدث):
🤝 المكسيك 0-0 البرتغال
🤝 المكسيك 1-1 بلجيكا
✅ المكسيك 2-0 غانا
✅ المكسيك 1-0 أستراليا
✅ المكسيك 5-1 صربيا

🚑 أبرز الغيابات:
لا توجد غيابات مؤثرة مؤكدة حالياً.

🇿🇦 جنوب أفريقيا

🌍 الترتيب العالمي: 60

📈 آخر 5 نتائج (الأقدم ← الأحدث):
✅ جنوب أفريقيا 3-2 زيمبابوي
❌ الكاميرون 2-1 جنوب أفريقيا
🤝 جنوب أفريقيا 1-1 بنما
❌ بنما 2-1 جنوب أفريقيا
🤝 جنوب أفريقيا 0-0 نيكاراغوا

🚑 أبرز الغيابات:
لا توجد غيابات مؤثرة مؤكدة حالياً.

📊 نسب التوقع:

🇲🇽 فوز المكسيك: 59%

🤝 التعادل: 25%

🇿🇦 فوز جنوب أفريقيا: 16%

🎯 النتيجة المتوقعة:

المكسيك 2-0 جنوب أفريقيا

📝 التحليل:

تدخل المكسيك المباراة بمعنويات مرتفعة بعد سلسلة نتائج إيجابية واختتام التحضيرات بفوز كبير على صربيا، إضافة إلى أفضلية الأرض والجمهور في افتتاح البطولة. جنوب أفريقيا منتخب منظم دفاعياً ويملك عناصر قادرة على إزعاج الخصوم، لكنه واجه صعوبات أمام منتخبات بمستوى قريب من المكسيك في الأشهر الأخيرة. الأفضلية تميل للمكسيك، لكن الضغط الجماهيري في المباراة الافتتاحية قد يجعل المواجهة أكثر تعقيداً مما تبدو عليه 
`
};

const matchKey = `${homeTeam}|${awayTeam}`;

const analysis =
matchAnalysis[matchKey] ||
`
لا يوجد تحليل لهذه المباراة حالياً.

سيتم إضافة التحليل قبل موعد المباراة.
`;

document.getElementById("matchInfoContent").innerHTML = `
<div style="
    text-align:right;
    line-height:2;
    font-size:18px;
    white-space:pre-line;
    background:#ffffff;
    padding:20px;
    border-radius:15px;
">
${analysis}
</div>
`;